game_reviews/app/controllers/games_controller.rb

SELECT "games".* FROM "games"
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 3]]
---
    def index
        render json: Game.all, include: [:reviews]